OF_Turorial_07/cavity/system/fvSchemes
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  9
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       dictionary;
    location    "system";
    object      fvSchemes;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

gradSchemes
{
    default         Gauss linear;
}

vrSchemes
{
    nIter           8;
    weightList      (1.0 2.0 3.0 4.0);
}

divSchemes
{
    default         none;
    flux            roe;
}

laplacianSchemes
{
    default         none;
}

wallDist
{
    method meshWave;
}


// ************************************************************************* //
